# BendingDetailSegmenetRepesentation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailSegmenetRepesentation Property
ParameterTypeId Class See Also
---
"Representation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailSegmenetRepesentation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailSegmenetRepesentation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailSegmenetRepesentation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace